app/controllers/school_classes_controller.rb

UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 3], ["updated_at", "2019-11-04 17:24:49.505844"], ["id", 2]]
---
  def update
    if @school_class.update(school_class_params)