app/controllers/students_controller.rb

  def update
    if @student.update(student_params)
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "the Liger "], ["updated_at", "2019-11-04 17:00:11.989816"], ["id", 16]]